{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report describing a Vite configuration change needed for correct base paths across deployment modes.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Defines Tailwind base layers and extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell mounting the React root and loading the main TypeScript entry module.",
  "frontend/src/App.tsx": "Root component that renders the TempleLayout without routing or additional logic.",
  "frontend/src/assets/popupMemeImages.ts": "Exports a list of meme image asset URLs using publicAssetUrl for the popup meme system.",
  "frontend/src/components/CharacterBadge.tsx": "Displays a fixed corner character illustration with a decorative badge plaque.",
  "frontend/src/components/departments/DepartmentSectionShell.tsx": "Provides a morphing‑border section container with themed backgrounds, decorative corners, and dynamic typography.",
  "frontend/src/components/departments/InstitutionOfAdvancedProcrastination.tsx": "Aggregates all procrastination‑themed department and micromodule sections into a single sequential block.",
  "frontend/src/components/departments/sections/AccreditationPage.tsx": "Displays a badge grid of comedic procrastination achievements inside a bureaucracy‑styled section shell.",
  "frontend/src/components/departments/sections/ActualHelp.tsx": "A minimal section that humorously advises users to close the site within a standard section shell.",
  "frontend/src/components/departments/sections/AncientProductivityProphecies.tsx": "Interactive section that displays humorous procrastination prophecies, with a random prophecy generator and static examples.",
  "frontend/src/components/departments/sections/ArchiveOfAlmostStarted.tsx": "Renders a timeline of near-started tasks and a humorous failure status within a styled department section.",
  "frontend/src/components/departments/sections/BureauOfTaskAvoidanceAnalytics.tsx": "Displays randomized avoidance metrics like peak hours, snack ratio, and excuse index with interactive visuals.",
  "frontend/src/components/departments/sections/CalculusOfDelay.tsx": "Interactive sliders calculate a humorous 'delay constant' based on motivation, Wi-Fi speed, and snack availability.",
  "frontend/src/components/departments/sections/CathedralOfMinorTasks.tsx": "Shows a grid of minor tasks users can 'admire' with counts tracked, emphasizing procrastinatory accomplishments.",
  "frontend/src/components/departments/sections/CosmicCourtroom.tsx": "Runs a staged trial simulation of procrastination with advancing phases and witness testimonies.",
  "frontend/src/components/departments/sections/CouncilOfFiveMoreMinutes.tsx": "Button interaction increments an ascension count, triggers effects, and displays progression after repeated presses.",
  "frontend/src/components/departments/sections/CouncilOfTomorrow.tsx": "Renders a static section with a single humorous message about reconvening tomorrow.",
  "frontend/src/components/departments/sections/DepartmentOfTaskRescheduling.tsx": "Provides a form for submitting task‑delay excuses and shows an approval message after submission.",
  "frontend/src/components/departments/sections/EmergencyProductivityButton.tsx": "Implements a multi‑step confirmation button that escalates prompts before ending in an anticlimax.",
  "frontend/src/components/departments/sections/FakeDonationFiveMoreMinutes.tsx": "Lets users donate pretend minutes, tracks total donated time, and shows a temporary confirmation.",
  "frontend/src/components/departments/sections/FocusSimulatorBeta.tsx": "Simulates entering deep focus only to interrupt users with a distraction prompt after a delay.",
  "frontend/src/components/departments/sections/GospelOfWifi.tsx": "Displays humorous Wi‑Fi parables and runs a fake speed test that returns a preset result.",
  "frontend/src/components/departments/sections/HallOfMiracles.tsx": "Shows a list of rare productivity 'miracles' and allows users to increment reaction counts for each.",
  "frontend/src/components/departments/sections/HolyBeanAnalyticsCenter.tsx": "Renders a humorous analytics section with fake caffeine metrics and a stylized bar chart inside a DepartmentSectionShell.",
  "frontend/src/components/departments/sections/LibraryOfSavedArticles.tsx": "Displays a list of saved-but-unread articles with categories and mock read-time info in a grid layout.",
  "frontend/src/components/departments/sections/MinistryOfDramaticPreparation.tsx": "Implements a step-based preparation ritual with progress tracking and a completion state.",
  "frontend/src/components/departments/sections/MultiverseOfProductivity.tsx": "Shows selectable productivity universes and reveals a result highlighting Universe C upon interaction.",
  "frontend/src/components/departments/sections/MuseumOfUnfinishedProjects.tsx": "Lists unfinished projects with progress percentages and hover‑revealed last‑accessed details.",
  "frontend/src/components/departments/sections/NormalCorporateAbout.tsx": "Provides an about section describing mission, team, research, and accreditation in a corporate style.",
  "frontend/src/components/departments/sections/NotificationOracle.tsx": "Generates random distraction-themed prophecies when the user clicks a button.",
  "frontend/src/components/departments/sections/OfficialExcuseGenerator.tsx": "Generates a random humorous excuse and displays an approval stamp animation. Uses state to show the selected excuse and delayed stamp.",
  "frontend/src/components/departments/sections/PomodoroResetShrine.tsx": "Implements a Pomodoro-style timer that auto-resets at 12 seconds and briefly shows a message. Provides start and reset controls with formatted countdown.",
  "frontend/src/components/departments/sections/ProductivityLeaderboard.tsx": "Displays a static comedic productivity leaderboard with styled ranking entries. Highlights the user's position with special formatting.",
  "frontend/src/components/departments/sections/ProductivityQuiz.tsx": "Renders a multi-question radio quiz with predetermined results. Tracks selected answers and switches to a results view on submit.",
  "frontend/src/components/departments/sections/QuantumExcuseGenerator.tsx": "Accepts a user deadline and reveals a playful quantum-themed excuse after calculation. Shows formatted date and humorous 'infinite time' message.",
  "frontend/src/components/departments/sections/ReincarnationPage.tsx": "Shows a themed page about procrastination cycles across reincarnations. Contains humorous descriptions and stylized sections.",
  "frontend/src/components/departments/sections/RestrictedVaultOfUrgentTasks.tsx": "Simulates attempting access to a vault that always denies entry. Toggles between initial prompt and denial message with a retry button.",
  "frontend/src/components/departments/sections/SacredScrollOfFocusTips.tsx": "Renders a section with an accordion of humorous focus tips inside a styled department shell.",
  "frontend/src/components/departments/sections/SacredTextsAppendix.tsx": "Displays digital commandments and a parable using accordions, with scroll depth state and decorative background.",
  "frontend/src/components/departments/sections/SeminaryOfSelfHelp.tsx": "Allows selecting joke self‑help courses and entering a name for a mock graduation ceremony with optional diploma display.",
  "frontend/src/components/departments/sections/SnackBlessingsPortal.tsx": "Shows a button to increment snack blessings and displays the total after the first click.",
  "frontend/src/components/departments/sections/StandaloneCameoMemeSections.tsx": "Provides multiple themed meme sections, each showing an image and humorous text inside department shells.",
  "frontend/src/components/departments/sections/TempleOfMindfulAvoidance.tsx": "Cycles through three humorous meditation steps with a button to advance or restart.",
  "frontend/src/components/departments/sections/TempleOfNewTabs.tsx": "Displays and increments a counter of 'emotional tabs' with themed styling and lore text.",
  "frontend/src/components/departments/sections/TermsAndConditionsOfEternalDelay.tsx": "Renders a humorous list of procrastination-themed terms and conditions inside a DepartmentSectionShell using scrollable sections.",
  "frontend/src/components/departments/sections/TimeManipulationOffice.tsx": "Implements a UI for calculating the next rounded start time and running a resettable countdown timer within a themed section.",
  "frontend/src/components/departments/sections/TimeTravelDepartment.tsx": "Displays a static, stylized depiction of how deadlines shift forward in time with no way back.",
  "frontend/src/components/departments/sections/TribunalOfDeadlines.tsx": "Shows a mock courtroom scene where a deadline accusation results in a verdict of postponement.",
  "frontend/src/components/departments/UnnecessaryAppendixDepartments.tsx": "Renders a list of extra appendix‑style departments related to humorous productivity themes.",
  "frontend/src/components/FramedMedia.tsx": "Animated scroll frame that progressively reveals four humorous commandments.",
  "frontend/src/components/HeadlineBlock.tsx": "Renders the main welcome headline, subheading, and introductory message.",
  "frontend/src/components/InfiniteRepeatBlocks.tsx": "Repeats its children infinitely using a sentinel trigger for scroll-based block generation.",
  "frontend/src/components/intro/CurtainIntroOverlay.tsx": "Provides an animated curtain overlay that blocks scroll, plays entrance/reveal animations, and unmounts after dismissal.",
  "frontend/src/components/media/UnnecessaryAudioExperiencesSection.tsx": "Presents themed audio clips such as ASMR and chant remixes inside a stylized DepartmentSectionShell.",
  "frontend/src/components/media/UnnecessaryVideoContentSection.tsx": "Renders a themed section with humorous video content, including a productivity parody and a looping candle livestream. Includes styled captions and decorative UI elements.",
  "frontend/src/components/microfeatures/AchievementPanel.tsx": "Displays a slide-out achievements panel showing unlocked and locked achievements. Uses a trigger button and maps achievement data into styled entries.",
  "frontend/src/components/microfeatures/AIConfessionBooth.tsx": "Provides a text‑input confession feature that displays a canned AI-style response after submission. Uses styled components and internal state to reveal the response panel.",
  "frontend/src/components/microfeatures/ApologyLoadingOverlay.tsx": "Shows a full-screen loading overlay with themed text and animated dots. Accepts an optional message prop for customization.",
  "frontend/src/components/microfeatures/ConfettiBurst.tsx": "Generates and animates confetti particles from a given x/y coordinate, clearing them after a short duration. Uses intervals to update particle physics.",
  "frontend/src/components/microfeatures/CursorSigh.tsx": "Occasionally displays fading sigh text at random screen locations. Uses timed intervals and cleanup to manage ephemeral sigh elements.",
  "frontend/src/components/microfeatures/DigitalChoirSting.tsx": "Exposes a function to emit a choir sound event through the microfeature event system. Provides no UI, just an action trigger.",
  "frontend/src/components/microfeatures/FakeCaptchaModal.tsx": "Shows a parody CAPTCHA modal where users select images and always fail verification. Tracks selected items and displays a failure message after attempting verification.",
  "frontend/src/components/microfeatures/HaloCursor.tsx": "Renders a halo image that follows the cursor and rotates continuously. Listens to mouse movement and updates position and rotation via intervals.",
  "frontend/src/components/microfeatures/JesusMicroCameoOverlay.tsx": "Displays a brief golden-flash Jesus overlay on scroll, dismissed on click or tap. Throttles scroll triggers and uses animations for fade-out effects.",
  "frontend/src/components/microfeatures/MicroFeaturesProvider.tsx": "Listens for microfeature events and triggers UI effects like confetti, toasts, captcha, loading overlays, and audio.",
  "frontend/src/components/microfeatures/RandomBackgroundPopupMemes.tsx": "Periodically spawns floating meme images at random positions and auto-removes them after animations.",
  "frontend/src/components/microfeatures/RandomGoldenFlashBurstOverlay.tsx": "Shows rapid golden flash bursts while the user scrolls, with randomized intervals and fade effects.",
  "frontend/src/components/microfeatures/ScrollTriggeredRevelationOverlay.tsx": "Displays a figure overlay with a randomized productivity quote during scroll-triggered revelation sequences.",
  "frontend/src/components/MicroHumor.tsx": "Shows small humor elements including a fake productivity assessment and disclaimer.",
  "frontend/src/components/micromodules/BureaucracyOfStarting.tsx": "A multi-step humorous form simulating bureaucratic barriers to starting a task.",
  "frontend/src/components/micromodules/ConfessionalHotline.tsx": "Shows a step-by-step chat transcript between the user and a bot, advancing through scripted lines.",
  "frontend/src/components/micromodules/DepartmentOfMicroAvoidance.tsx": "Lets users log small avoidance actions and tracks click counts with a humorous XP summary.",
  "frontend/src/components/micromodules/EmotionalStockMarket.tsx": "Displays mock emotional 'stocks' that update their values on an interval.",
  "frontend/src/components/micromodules/ExistentialPage.tsx": "Renders a dramatic message about identity and productivity in a styled module shell.",
  "frontend/src/components/micromodules/FinalAbsurdLayer.tsx": "Multi-tab micromodule showing terms text, glossary, myth pages, a calendar, and a simple contact response.",
  "frontend/src/components/micromodules/GeneticAnalysisPage.tsx": "Simulated DNA analysis with a progress bar that reveals humorous results on completion.",
  "frontend/src/components/micromodules/HallOfExtremelyMinorVictories.tsx": "Displays a grid of small achievement cards styled as humorous gold awards.",
  "frontend/src/components/micromodules/HolySpiritJustASecondTooltip.tsx": "Randomly appearing tooltip that opens a dialog with rotating trivia when clicked.",
  "frontend/src/components/micromodules/JesusSelfHelpEinsteinVoiceSeries.tsx": "Lists themed episode titles inside a styled micromodule shell.",
  "frontend/src/components/micromodules/MathematicsOfAfterThis.tsx": "Simple calculator-style module posing a joke math problem and revealing a humorous answer.",
  "frontend/src/components/micromodules/MicroModuleShell.tsx": "Common layout wrapper providing ornate styled framing and a title for micromodules.",
  "frontend/src/components/micromodules/MiracleTracker.tsx": "Checkbox list for tracking small 'miracles' with a fixed probability display.",
  "frontend/src/components/micromodules/MuseumGiftShop.tsx": "Displays merchandise items with prices and add-to-cart buttons inside a themed shell.",
  "frontend/src/components/micromodules/NationalReferendum.tsx": "Shows referendum-style results comparing 'Yes' vs 'No' using progress bars.",
  "frontend/src/components/micromodules/NotificationSimulator.tsx": "Toggles periodic random toast notifications using predefined message options.",
  "frontend/src/components/micromodules/OfficialIDCardGenerator.tsx": "Renders a micro-module that shows a button to generate a stylized ID card with random ID text.",
  "frontend/src/components/micromodules/PremiumMembershipTier.tsx": "Displays a premium membership card listing benefits and an upgrade button.",
  "frontend/src/components/micromodules/ProductivityChoir.tsx": "Creates a hover-activated card that reveals a playful productivity message.",
  "frontend/src/components/micromodules/ProductivityCultDocumentary.tsx": "Shows a faux documentary section with styled video placeholder and narration text.",
  "frontend/src/components/micromodules/ProductivityYogaSection.tsx": "Lists themed yoga poses in a grid layout within a styled module.",
  "frontend/src/components/micromodules/SacredRefrigeratorCam.tsx": "Displays a mock refrigerator livestream view with a humorous message.",
  "frontend/src/components/micromodules/StartMondayPortal.tsx": "Renders a portal that always declares plans start next Monday and notes if today is Monday.",
  "frontend/src/components/OnboardingPrompt.tsx": "Interactive confession form with radio options and buttons that trigger a humorous confirmation alert.",
  "frontend/src/components/OrnateMorphingSectionFrame.tsx": "A wrapper component that applies a scroll‑morphing clip‑path border and decorative visuals around its children.",
  "frontend/src/components/TempleLayout.tsx": "Main page layout assembling navigation, onboarding frames, departments, media sections, and global microfeature overlays.",
  "frontend/src/components/TopNavBar.tsx": "Renders a top navigation bar with buttons that smooth‑scroll to page sections using background imagery.",
  "frontend/src/hooks/useAchievements.ts": "Manages achievement state with localStorage persistence and provides unlock/reset helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query and identity changes.",
  "frontend/src/hooks/useAutoplayFallbackBackgroundAudio.ts": "Handles autoplaying looping background audio with fallback user-interaction triggers.",
  "frontend/src/hooks/useCurtainIntroFlag.ts": "Tracks and stores whether an intro curtain has been dismissed using sessionStorage.",
  "frontend/src/hooks/useDualAutoplayFallbackBackgroundAudio.ts": "Attempts autoplay for two layered audio tracks with interaction-based fallback and cleanup.",
  "frontend/src/hooks/useInfinitePageRepeat.ts": "Implements infinite page block repetition using an intersection observer capped at three blocks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication with login, logout, and status tracking.",
  "frontend/src/hooks/useMicrofeatureEvents.ts": "Implements a simple publish/subscribe system for microfeature events like confetti, toasts, and audio cues.",
  "frontend/src/hooks/useScrollActivity.ts": "Tracks whether the user is currently scrolling and becomes inactive after a short timeout.",
  "frontend/src/hooks/useScrollOrnateBorderMorph.ts": "Maps scroll position to a morphing border shape and a continuous scroll phase value.",
  "frontend/src/hooks/useScrollTriggeredRevelation.ts": "Triggers cameo figures at specific scroll thresholds with reveal and fade-out behavior.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, dark mode styles, and detailed curtain animation and layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds asset URLs using Vite's base path to ensure correct loading in different deployment contexts.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugin integrations.",
  "frontend/vite.config.ts": "Sets up Vite with React, aliasing, deployment-aware base paths, and dev server settings.",
  "project_state.json": "Tracks the project's state, requirements, known issues, and architectural notes for ongoing development."
}
