{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of many frontend components and styles.",
  "frontend/index.css": "Defines global Tailwind layers and color variables for light/dark themes using OKLCH values.",
  "frontend/index.html": "Base HTML page wiring the root element and loading main.tsx.",
  "frontend/src/App.tsx": "Root component rendering the TempleLayout.",
  "frontend/src/assets/popupMemeImages.ts": "Exports list of locally served popup meme image paths.",
  "frontend/src/components/CharacterBadge.tsx": "Fixed-position character illustration with an overlaid decorative badge.",
  "frontend/src/components/departments/DepartmentSectionShell.tsx": "Shared container for department sections with morphing borders, decorative patterns, and dynamic typography. Uses scroll state to vary clip‑paths and title styling.",
  "frontend/src/components/departments/InstitutionOfAdvancedProcrastination.tsx": "Aggregates a large set of procrastination‑themed department sections and micro‑modules into a single rendered sequence. Provides the main departmental content block.",
  "frontend/src/components/departments/sections/AccreditationPage.tsx": "Displays a grid of humorous procrastination-themed badges inside a department shell.",
  "frontend/src/components/departments/sections/ActualHelp.tsx": "Renders a simple help section telling the user to close the site.",
  "frontend/src/components/departments/sections/AncientProductivityProphecies.tsx": "Provides a random prophecy generator with preset humorous predictions and a few static prophecy cards.",
  "frontend/src/components/departments/sections/ArchiveOfAlmostStarted.tsx": "Shows a timeline of procrastination events and a humorous failure status message.",
  "frontend/src/components/departments/sections/BureauOfTaskAvoidanceAnalytics.tsx": "Displays spoof analytics like peak avoidance hours, snack ratio, and excuse diversity with dynamic values.",
  "frontend/src/components/departments/sections/CalculusOfDelay.tsx": "Interactive sliders let users adjust variables to compute a comedic 'delay constant'.",
  "frontend/src/components/departments/sections/CathedralOfMinorTasks.tsx": "Lists minor procrastination tasks with an admire toggle and tracks total admired items.",
  "frontend/src/components/departments/sections/CosmicCourtroom.tsx": "Interactive trial simulation component that advances through staged content and displays witness testimonies at stage 1.",
  "frontend/src/components/departments/sections/CouncilOfFiveMoreMinutes.tsx": "Button-triggered ascension counter with dimming effect, confetti events, and an achievement on first use.",
  "frontend/src/components/departments/sections/CouncilOfTomorrow.tsx": "Static component displaying a single unchanging message encouraging users to return tomorrow.",
  "frontend/src/components/departments/sections/DepartmentOfTaskRescheduling.tsx": "Form for submitting a task postponement request that briefly shows an approval message on submission.",
  "frontend/src/components/departments/sections/EmergencyProductivityButton.tsx": "Multi-step confirmation flow that cycles through prompts before ending in a resettable 'nothing happens' screen.",
  "frontend/src/components/departments/sections/FakeDonationFiveMoreMinutes.tsx": "Mock donation interface letting users 'donate minutes,' with confirmation feedback and a running total displayed.",
  "frontend/src/components/departments/sections/FocusSimulatorBeta.tsx": "Simulated focus mode that interrupts users after a delay and redirects them when they choose distraction.",
  "frontend/src/components/departments/sections/GospelOfWifi.tsx": "A humorous Wi‑Fi themed section with a mock speed test and sacred‑style text blocks.",
  "frontend/src/components/departments/sections/HallOfMiracles.tsx": "Displays a list of ‘miracles’ and tracks user reactions by incrementing counts.",
  "frontend/src/components/departments/sections/HolyBeanAnalyticsCenter.tsx": "Shows static fake caffeine analytics and a mock chart comparing caffeine to productivity.",
  "frontend/src/components/departments/sections/LibraryOfSavedArticles.tsx": "Lists saved articles with categories and exaggerated unread status messaging.",
  "frontend/src/components/departments/sections/MinistryOfDramaticPreparation.tsx": "Implements a step‑based ritual progress UI with completion tracking and reset.",
  "frontend/src/components/departments/sections/MultiverseOfProductivity.tsx": "Shows multiple ‘universes’ of productivity and selects one to reveal the user’s reality.",
  "frontend/src/components/departments/sections/MuseumOfUnfinishedProjects.tsx": "Displays unfinished projects with hover‑revealed emotional last‑access info.",
  "frontend/src/components/departments/sections/NormalCorporateAbout.tsx": "Renders an about section with themed text blocks describing mission, team, research, and accreditation inside a DepartmentSectionShell.",
  "frontend/src/components/departments/sections/NotificationOracle.tsx": "Displays a button that reveals a random prophecy message, wrapped in a DepartmentSectionShell.",
  "frontend/src/components/departments/sections/OfficialExcuseGenerator.tsx": "Generates a random humorous excuse with an animated approval stamp using state and delays.",
  "frontend/src/components/departments/sections/PomodoroResetShrine.tsx": "Implements a self-resetting 25‑minute timer that triggers a message at 12 seconds before resetting.",
  "frontend/src/components/departments/sections/ProductivityLeaderboard.tsx": "Shows a static, styled leaderboard highlighting humorous productivity rankings.",
  "frontend/src/components/departments/sections/ProductivityQuiz.tsx": "Provides a multi-question quiz with radio options and a predetermined result display.",
  "frontend/src/components/departments/sections/QuantumExcuseGenerator.tsx": "Accepts a deadline and displays a playful quantum‑themed excuse once submitted.",
  "frontend/src/components/departments/sections/ReincarnationPage.tsx": "Renders a humorous sacred-themed section about procrastination cycles with stylized text and decorative panels.",
  "frontend/src/components/departments/sections/RestrictedVaultOfUrgentTasks.tsx": "Displays an interactive vault interface where attempts to access always result in a comedic access-denied message.",
  "frontend/src/components/departments/sections/SacredScrollOfFocusTips.tsx": "Shows a list of focus tips inside an accordion UI with playful, procrastination-themed content.",
  "frontend/src/components/departments/sections/SacredTextsAppendix.tsx": "Provides expandable lists of comedic digital commandments and parable segments within a sacred-styled layout.",
  "frontend/src/components/departments/sections/SeminaryOfSelfHelp.tsx": "Offers selectable humorous self-help courses and a mock graduation form that reveals a diploma when completed.",
  "frontend/src/components/departments/sections/SnackBlessingsPortal.tsx": "A simple interactive section that increments and displays snack blessings when a button is clicked.",
  "frontend/src/components/departments/sections/StandaloneCameoMemeSections.tsx": "Renders multiple themed meme sections featuring humorous captions and images across sacred, infernal, and pop-culture styles.",
  "frontend/src/components/departments/sections/TempleOfMindfulAvoidance.tsx": "Shows a step-based meditation sequence that humorously ends with opening another tab.",
  "frontend/src/components/departments/sections/TempleOfNewTabs.tsx": "A playful section displaying a growing counter of imaginary 'emotional tabs' with a button to increment it.",
  "frontend/src/components/departments/sections/TermsAndConditionsOfEternalDelay.tsx": "Renders a scrollable list of humorous procrastination-themed terms and conditions.",
  "frontend/src/components/departments/sections/TimeManipulationOffice.tsx": "Provides a countdown feature and calculates the next 'optimal' rounded start time with interactive UI elements.",
  "frontend/src/components/departments/sections/TimeTravelDepartment.tsx": "Shows a stylized visualization of how deadlines drift forward in time with no return path.",
  "frontend/src/components/departments/sections/TribunalOfDeadlines.tsx": "Displays a courtroom-style scene where excuses lead to every deadline being officially postponed.",
  "frontend/src/components/departments/UnnecessaryAppendixDepartments.tsx": "Renders a collection of appendix‑style humorous department sections. Groups various themed subsections into one container.",
  "frontend/src/components/FramedMedia.tsx": "Ornate framed scroll component that progressively reveals humorous commandments.",
  "frontend/src/components/HeadlineBlock.tsx": "Displays main temple headline, subtitle, and intro text.",
  "frontend/src/components/InfiniteRepeatBlocks.tsx": "Repeats wrapped content infinitely using a sentinel and scroll detection.",
  "frontend/src/components/intro/CurtainIntroOverlay.tsx": "Full‑screen animated curtain overlay that locks scroll, animates open on click, and unmounts after reveal.",
  "frontend/src/components/media/UnnecessaryAudioExperiencesSection.tsx": "Section showcasing humorous ASMR and audio clips themed around procrastination and productivity.",
  "frontend/src/components/media/UnnecessaryVideoContentSection.tsx": "Renders a themed section containing humorous video content blocks with styled containers and captions.",
  "frontend/src/components/microfeatures/AchievementPanel.tsx": "Implements a slide-out panel showing a list of achievements with unlock status and a trigger button.",
  "frontend/src/components/microfeatures/AIConfessionBooth.tsx": "Provides a form where users submit a confession and receive a canned response inside a styled section.",
  "frontend/src/components/microfeatures/ApologyLoadingOverlay.tsx": "Displays a full-screen loading overlay with animated elements and a customizable apology message.",
  "frontend/src/components/microfeatures/ConfettiBurst.tsx": "Generates and animates a burst of confetti particles from a given coordinate, auto-clearing after 2 seconds.",
  "frontend/src/components/microfeatures/CursorSigh.tsx": "Occasionally shows transient sigh text at random screen positions, fading out after a delay.",
  "frontend/src/components/microfeatures/DigitalChoirSting.tsx": "Exposes a function to emit an audio microfeature event for a 'choir' sound effect.",
  "frontend/src/components/microfeatures/FakeCaptchaModal.tsx": "Shows a modal with a humorous CAPTCHA selection grid and always fails verification on submit.",
  "frontend/src/components/microfeatures/HaloCursor.tsx": "Renders a rotating halo graphic that follows the user's cursor position.",
  "frontend/src/components/microfeatures/JesusMicroCameoOverlay.tsx": "Triggers a brief Jesus-themed overlay flash on scroll, dismissible on click or tap.",
  "frontend/src/components/microfeatures/MicroFeaturesProvider.tsx": "Listens for microfeature events to trigger UI effects like confetti, toasts, achievements, audio, captcha, and loading overlays, and renders persistent microfeature components.",
  "frontend/src/components/microfeatures/RandomBackgroundPopupMemes.tsx": "Periodically spawns and auto-removes floating meme images at random positions and sizes across the screen.",
  "frontend/src/components/microfeatures/RandomGoldenFlashBurstOverlay.tsx": "Shows rapid, bright golden flash overlays while the user is scrolling, with randomized timing and duration.",
  "frontend/src/components/microfeatures/ScrollTriggeredRevelationOverlay.tsx": "Displays a full-screen figure with randomized humorous 'lessons' during scroll-triggered revelation events, with fade and animation effects.",
  "frontend/src/components/MicroHumor.tsx": "Shows corner note, fake loading bar with timed result, and humorous disclaimer.",
  "frontend/src/components/micromodules/BureaucracyOfStarting.tsx": "Renders a multi-step humorous bureaucratic form that progresses through text inputs and a questionnaire before ending with a 'system busy' message.",
  "frontend/src/components/micromodules/ConfessionalHotline.tsx": "Plays through a short scripted chat sequence between the user and a bot, advancing one line at a time.",
  "frontend/src/components/micromodules/DepartmentOfMicroAvoidance.tsx": "Lets users record micro-avoidance actions, tracking counts per item and displaying static XP humor.",
  "frontend/src/components/micromodules/EmotionalStockMarket.tsx": "Shows a list of emotional 'stocks' whose values update periodically based on their trend.",
  "frontend/src/components/micromodules/ExistentialPage.tsx": "Displays a single dramatic existential quote inside a styled module shell.",
  "frontend/src/components/micromodules/FinalAbsurdLayer.tsx": "Renders a tabbed interface with humorous placeholder content including long text, glossary, myth pages, a calendar, and a contact action.",
  "frontend/src/components/micromodules/GeneticAnalysisPage.tsx": "Simulates a DNA analysis with an auto-increasing progress bar and reveals a comedic result when complete.",
  "frontend/src/components/micromodules/HallOfExtremelyMinorVictories.tsx": "Displays a grid of humorous minor achievements, each styled like a celebratory award.",
  "frontend/src/components/micromodules/HolySpiritJustASecondTooltip.tsx": "Shows a randomly positioned tooltip at intervals that opens a dialog with random trivia when clicked.",
  "frontend/src/components/micromodules/JesusSelfHelpEinsteinVoiceSeries.tsx": "Lists themed humorous episode titles styled within a decorative module shell.",
  "frontend/src/components/micromodules/MathematicsOfAfterThis.tsx": "Provides inputs for a playful time-calculation joke and reveals a humorous 'Yes' answer when triggered.",
  "frontend/src/components/micromodules/MicroModuleShell.tsx": "A decorative layout wrapper that adds ornate styling, a title, and optional emoji around module content.",
  "frontend/src/components/micromodules/MiracleTracker.tsx": "Lets users toggle ‘miracle’ checkboxes and displays a fixed humorous miracle probability.",
  "frontend/src/components/micromodules/MuseumGiftShop.tsx": "Shows a list of fictional merchandise items with prices and cart buttons plus a delayed-purchase button.",
  "frontend/src/components/micromodules/NationalReferendum.tsx": "Displays a mock vote on starting a task with progress bars showing heavily skewed results.",
  "frontend/src/components/micromodules/NotificationSimulator.tsx": "Triggers random toast notifications when activated, simulating distracting device alerts.",
  "frontend/src/components/micromodules/OfficialIDCardGenerator.tsx": "Renders a module that shows a button to generate a mock ID card and displays a stylized card with random ID once clicked.",
  "frontend/src/components/micromodules/PremiumMembershipTier.tsx": "Displays a premium membership module listing benefits and an upgrade button in a styled container.",
  "frontend/src/components/micromodules/ProductivityChoir.tsx": "Implements a hover-triggered card that reveals a humorous chant inside a styled micromodule shell.",
  "frontend/src/components/micromodules/ProductivityCultDocumentary.tsx": "Shows a faux documentary section with dramatic title, mock video area, and narration text.",
  "frontend/src/components/micromodules/ProductivityYogaSection.tsx": "Presents a grid of humorous productivity-themed yoga poses inside a styled micromodule.",
  "frontend/src/components/micromodules/SacredRefrigeratorCam.tsx": "Displays a mock refrigerator livestream panel with a message implying nothing has changed.",
  "frontend/src/components/micromodules/StartMondayPortal.tsx": "Renders a portal emphasizing that plans start next Monday, optionally noting if today is Monday.",
  "frontend/src/components/OnboardingPrompt.tsx": "Interactive confession selector with buttons that reveal a temporary alert message. Manages chosen confession and shows a playful confirmation on submit.",
  "frontend/src/components/OrnateMorphingSectionFrame.tsx": "Wrapper that applies a scroll‑driven morphing clip‑path border and decorative elements around child content. Uses a custom hook to switch shapes and preserve interaction inside.",
  "frontend/src/components/TempleLayout.tsx": "Main page layout assembling navigation, onboarding, departments, media sections, and multiple microfeatures. Integrates scroll‑triggered effects and dual background audio.",
  "frontend/src/components/TopNavBar.tsx": "Top navigation bar that lists sections and smooth‑scrolls to targets when clicked. Renders a styled background and responsive button list.",
  "frontend/src/hooks/useAchievements.ts": "Manages achievement state with localStorage persistence and provides functions to unlock or reset achievements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query and reacts to identity changes.",
  "frontend/src/hooks/useAutoplayFallbackBackgroundAudio.ts": "Autoplays looping background audio with fallback listeners for user interaction when autoplay is blocked.",
  "frontend/src/hooks/useCurtainIntroFlag.ts": "Tracks whether an intro curtain has been dismissed using sessionStorage and provides a dismiss handler.",
  "frontend/src/hooks/useDualAutoplayFallbackBackgroundAudio.ts": "Attempts to autoplay two layered audio tracks with fallback interaction listeners and cleanup.",
  "frontend/src/hooks/useInfinitePageRepeat.ts": "Provides logic for appending repeated page blocks using an intersection observer, capped to three blocks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, handling login, stored identities, and login state flags.",
  "frontend/src/hooks/useMicrofeatureEvents.ts": "Implements a global pub/sub system for emitting and subscribing to small UI events like confetti, toasts, and audio.",
  "frontend/src/hooks/useScrollActivity.ts": "Tracks whether the user is actively scrolling and returns a boolean that becomes false after inactivity.",
  "frontend/src/hooks/useScrollOrnateBorderMorph.ts": "Maps scroll position to a 0–1 phase value and dynamically selects a geometric border shape based on scroll percentage.",
  "frontend/src/hooks/useScrollTriggeredRevelation.ts": "Triggers cameo figure overlays at specific scroll thresholds and manages reveal/fade-out state with dismissal handling.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive custom color variables plus styles for a full-screen animated curtain overlay.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, fonts, animations, and plugin integrations.",
  "project_state.json": "Describes the project's current requirements, architectural constraints, known issues, and pending fixes for the ornate single-page app."
}